# Werkcollege-opdrachten Week 1.2

## Voorbereiding

Importeer in het codeblok hieronder de packages die worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
N.B.: de 2 reeds geschreven coderegels zorgen ervoor dat eventuele warnings, die code-outputs lelijker maken, uitgezet worden.

In [16]:

import warnings
import pandas as pd
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk terug te vinden map:
- go_sales_train.sqlite
- go_crm_train.sqlite
- go_staff_train.sqlite

Bestudeer de bovenste 3 bestanden in DB Browser (SQLite), <a href="https://sqlitebrowser.org/dl/">hier</a> te downloaden. Wat valt je op qua datatypen?<br>

in plaats van varchar is het text

## Databasetabel inlezen

Creëer een databaseconnectie met het bestand go_sales_train.sqlite.

In [ ]:
import sqlite3 as sql


con = sql.connect("../../data/raw/go_sales_train.sqlite")

<b>Let goed op:</b><br>
Als je per ongeluk een verkeerde bestandsnaam ingeeft, maakt Python zélf een leeg databasebestand aan! Er ontstaat dan dus een nieuwe .sqlite, en dat is nadrukkelijk <u>niet de bedoeling.</u>

Gebruik de onderstaande sql_query om te achterhalen welke databasetabellen in go_sales_train zitten.

In [15]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
con_cursor = con.cursor()

con_cursor.execute(sql_query)

response = con_cursor.fetchall()

for row in response:
    print(row)

('country',)
('order_details',)
('order_header',)
('order_method',)
('product',)
('product_line',)
('product_type',)
('retailer_site',)
('return_reason',)
('returned_item',)
('sales_branch',)
('sales_staff',)

Krijg je lege output? Dan heb je per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br>
Lees de informatie onder het kopje <u>Let goed op:</u> hierboven nog eens goed door.

Gebruik de gecreëerde databaseconnectie om de resultaten van de volgende query in een DataFrame te zetten:<br>
*SELECT * FROM sales_staff*

In [86]:
query = "SELECT * FROM sales_staff;"
#Vul dit codeblok verder in
con_cursor = con.cursor()

con_cursor.execute(query)

response = con_cursor.fetchall()

salesStaffDf = pd.DataFrame(response)

print(salesStaffDf)

       0          1          2                             3  \
0      4      Denis       Pagé                Branch Manager
1      5  Élizabeth     Michel  Level 3 Sales Representative
2      6      Émile   Clermont  Level 1 Sales Representative
3      7    Étienne     Jauvin  Level 2 Sales Representative
4     12    Elsbeth  Wiesinger  Level 2 Sales Representative
..   ...        ...        ...                           ...
97   120      Giele   Laermans  Level 1 Sales Representative
98   121   François    De Crée  Level 1 Sales Representative
99   122     Yvette    Lattrez  Level 3 Sales Representative
100  123      Willi  Seefelder  Level 2 Sales Representative
101  124     Sabine     Grüner  Level 3 Sales Representative

                     4       5                  6                       7  \
0    +33 1 68 94 52 20   325.0  +33 1 68 94 56 60       DPage@grtd123.com
1    +33 1 68 94 52 20   336.0  +33 1 68 94 56 60     EMichel@grtd123.com
2    +33 1 68 94 52 20   378.0  +33 1 68 94 56 60   EClermont@grtd123.com
3    +33 1 68 94 52 20   398.0  +33 1 68 94 56 60     EJauvin@grtd123.com
4    +(49) 40 663 1990  1818.0  +(49) 40 663 4571  EWiesinger@grtd123.com
..                 ...     ...                ...                     ...
97     +32 16 20.73.21  1340.0    +32 16 20.73.32   GLaermans@grtd123.com
98     +32 16 20.73.21  1642.0    +32 16 20.73.32     FDecree@grtd123.com
99     +32 16 20.73.21  1633.0    +32 16 20.73.32    YLattrez@grtd123.com
100  +(43) 13 79 56 32   325.0  +(43) 13 79 56 33  WSeefelder@grtd123.com
101  +(43) 13 79 56 32   348.0  +(43) 13 79 56 33     SGruner@grtd123.com

              8   9
0    1996-11-03   6
1    1995-06-08   6
2    1998-04-07   6
3    1997-08-16   6
4    1997-02-27  13
..          ...  ..
97   1999-11-15  38
98   1999-12-01  38
99   1999-12-09  38
100  1998-10-28  39
101  1998-02-18  39

[102 rows x 10 columns]

## Datumkolommen

Zoals je misschien al hebt gezien in DB Browser, zijn datums als TEXT opgeslagen, en niet als DATE, DATETIME o.i.d. Hier moeten we dus nog even "typische datumkolommen" van maken. Dat doen we met de volgende code:

In [ ]:
sales_staff['DATE_HIRED'] = pd.to_datetime(sales_staff['DATE_HIRED'])
sales_staff.dtypes

Als we hier het jaar uit willen halen, schrijven we:

In [21]:
pd.DatetimeIndex(sales_staff['DATE_HIRED']).quarter

TypeError: string indices must be integers, not 'str'

Deze zelfde syntax is te gebruiken voor het extraheren van kwartalen, maanden, weken en dagen. Probeer het maar eens!

## DataFrames uitsplitsen en opbouwen met Series

De volgende 5 kolommen hebben betrekking op de contactdetails van elke medewerker in dit DataFrame:
- SALES_STAFF_CODE
- WORK_PHONE
- EXTENSION
- FAX
- EMAIL

Maak van elk van deze 5 kolommen een serie.

In [76]:
salesSerie = pd.Series(salesStaffDf.loc[:, 0])
workSerie = pd.Series(salesStaffDf.loc[:, 1])
extensionSerie = pd.Series(salesStaffDf.loc[:, 2])
faxSerie = pd.Series(salesStaffDf.loc[:, 3])
emailSerie = pd.Series(salesStaffDf.loc[:, 4])

print(salesSerie)
print(workSerie)
print(extensionSerie)
print(faxSerie)
print(emailSerie)

0        4
1        5
2        6
3        7
4       12
      ...
97     120
98     121
99     122
100    123
101    124
Name: 0, Length: 102, dtype: int64
0          Denis
1      Élizabeth
2          Émile
3        Étienne
4        Elsbeth
         ...
97         Giele
98      François
99        Yvette
100        Willi
101       Sabine
Name: 1, Length: 102, dtype: object
0           Pagé
1         Michel
2       Clermont
3         Jauvin
4      Wiesinger
         ...
97      Laermans
98       De Crée
99       Lattrez
100    Seefelder
101       Grüner
Name: 2, Length: 102, dtype: object
0                    Branch Manager
1      Level 3 Sales Representative
2      Level 1 Sales Representative
3      Level 2 Sales Representative
4      Level 2 Sales Representative
                   ...
97     Level 1 Sales Representative
98     Level 1 Sales Representative
99     Level 3 Sales Representative
100    Level 2 Sales Representative
101    Level 3 Sales Representative
Name: 3, Length: 102, dtype: object
0      +33 1 68 94 52 20
1      +33 1 68 94 52 20
2      +33 1 68 94 52 20
3      +33 1 68 94 52 20
4      +(49) 40 663 1990
             ...
97       +32 16 20.73.21
98       +32 16 20.73.21
99       +32 16 20.73.21
100    +(43) 13 79 56 32
101    +(43) 13 79 56 32
Name: 4, Length: 102, dtype: object

Zet allevijf gecreëerde series als kolommen naast elkaar in een DataFrame (*contact_details*). Gebruik pd.concat(...)<br>
Hulpvraag: welke waarde geef je aan de axis-parameter?

In [88]:


contact_details = pd.concat([salesSerie,workSerie, extensionSerie,faxSerie,emailSerie], axis = 1)

print(contact_details)

       0          1          2                             3  \
0      4      Denis       Pagé                Branch Manager
1      5  Élizabeth     Michel  Level 3 Sales Representative
2      6      Émile   Clermont  Level 1 Sales Representative
3      7    Étienne     Jauvin  Level 2 Sales Representative
4     12    Elsbeth  Wiesinger  Level 2 Sales Representative
..   ...        ...        ...                           ...
97   120      Giele   Laermans  Level 1 Sales Representative
98   121   François    De Crée  Level 1 Sales Representative
99   122     Yvette    Lattrez  Level 3 Sales Representative
100  123      Willi  Seefelder  Level 2 Sales Representative
101  124     Sabine     Grüner  Level 3 Sales Representative

                     4
0    +33 1 68 94 52 20
1    +33 1 68 94 52 20
2    +33 1 68 94 52 20
3    +33 1 68 94 52 20
4    +(49) 40 663 1990
..                 ...
97     +32 16 20.73.21
98     +32 16 20.73.21
99     +32 16 20.73.21
100  +(43) 13 79 56 32
101  +(43) 13 79 56 32

[102 rows x 5 columns]

## Series en DataFrames maken vanuit lists en dictionaries

Met .head(*getal*) kan je de bovenste *getal* rijen van een tabel selecteren.<br>
Selecteer op deze manier de bovenste 5 rijen van *contact_details*.<br>
Sla dit resultaat op in een nieuw DataFrame.

In [90]:

newData = {0: ["testcode"], 1: ["testphone"], 2: ["testextension"], 3: ["testfax"], 4: ["testmail"]}
newData = pd.DataFrame(newData)

test = pd.concat([contact_details, newData], ignore_index=True)


test.head(5)

    0          1          2                             3                  4
0   4      Denis       Pagé                Branch Manager  +33 1 68 94 52 20
1   5  Élizabeth     Michel  Level 3 Sales Representative  +33 1 68 94 52 20
2   6      Émile   Clermont  Level 1 Sales Representative  +33 1 68 94 52 20
3   7    Étienne     Jauvin  Level 2 Sales Representative  +33 1 68 94 52 20
4  12    Elsbeth  Wiesinger  Level 2 Sales Representative  +(49) 40 663 1990

Aan deze 10 rijen met contactdetails willen we 3 kolommen toevoegen: 'FIRST_LANGUAGE', 'SECOND_LANGUAGE' & 'THIRD_LANGUAGE'.<br>
Iedereens 'First Language' is Engels, afgekort 'EN'. Maak een lijst waarin 5x 'EN' staat.<br>
Converteer deze lijst vervolgens naar een serie en voeg deze horizontaal samen met het resultaat van de vorige opdracht.<br>
Vergeet niet een passende naam te geven aan de nieuw ontstane kolom.

In [ ]:
data = {"firstLanguage": ['EN', 'EN','EN', 'EN','EN']}

firstLanSerie = pd.Series(["EN"], name = "FIRST_LANGUAGE", )

test.insert(5,"FIRST_LANGUAGE", firstLanSerie )



test.head(5)
# df.head(-1)

,0,1,2,3,4,FIRST_LANGUAGE
0,4,Denis,Pagé,Branch Manager,+33 1 68 94 52 20,EN
1,5,Élizabeth,Michel,Level 3 Sales Representative,+33 1 68 94 52 20,NaN
2,6,Émile,Clermont,Level 1 Sales Representative,+33 1 68 94 52 20,NaN
3,7,Étienne,Jauvin,Level 2 Sales Representative,+33 1 68 94 52 20,NaN
4,12,Elsbeth,Wiesinger,Level 2 Sales Representative,+(49) 40 663 1990,NaN

Maak nu de tweede kolom ('SECOND_LANGUAGE'). Maak daarvoor een dictionary, met daarin...
- Als keys: alle indexen uit het resultaat van het vorige codeblok.
- Als values: bij de eerste 3 elementen 'FR' (Frankrijk), bij de laatste 2 'DE' (Duitsland).

Maak vervolgens ook hier weer een serie van en voeg ook deze weer horizontaal samen met het rsultaat van de vorige opdracht.<br>
Vergeet niet een passende naam te geven aan de nieuw ontstane kolom.

In [ ]:


secondlandict = {
    0: "FR",
    1: "FR",
    2: "FR",
    3: "DE",
    4: "DE"
 
}


test.insert(5,"SECOND_LANGUAGE", dict )



test.head(5)

,0,1,2,3,4,SECOND_LANGUAGE,FIRST_LANGUAGE
0,4,Denis,Pagé,Branch Manager,+33 1 68 94 52 20,FR,EN
1,5,Élizabeth,Michel,Level 3 Sales Representative,+33 1 68 94 52 20,FR,NaN
2,6,Émile,Clermont,Level 1 Sales Representative,+33 1 68 94 52 20,FR,NaN
3,7,Étienne,Jauvin,Level 2 Sales Representative,+33 1 68 94 52 20,DE,NaN
4,12,Elsbeth,Wiesinger,Level 2 Sales Representative,+(49) 40 663 1990,DE,NaN

Maak ten slotte de derde kolom ('THIRD_LANGUAGE') door een dictionary te maken met daarin...
- Als key: de naam van de nieuwe kolom. Zie je het verschil qua keys met de vorige opdracht?
- Als waarde: een lijst met daarin 'NL', 'NL', 'JPN', 'JPN', 'KOR'.

Converteer deze dictionary nu naar een DataFrame en voeg deze horizontaal samen met het resultaat van de vorige opdracht.<br>
Waarom hoef je hierna de nieuw ontstane kolom geen passende naam meer te geven?

In [ ]:
thridlandict = {
    "THIRD_LANGUAGE": ["NL", "NL", "JPN", "JPN", "KOR"]
}

thirdDF = pd.DataFrame(dict)

test.insert(5,"THIRD_LANGUAGE",thirdDF)

test.head(5)

,0,1,2,3,4,THIRD_LANGUAGE,SECOND_LANGUAGE,FIRST_LANGUAGE
0,4,Denis,Pagé,Branch Manager,+33 1 68 94 52 20,NL,FR,EN
1,5,Élizabeth,Michel,Level 3 Sales Representative,+33 1 68 94 52 20,NL,FR,NaN
2,6,Émile,Clermont,Level 1 Sales Representative,+33 1 68 94 52 20,JPN,FR,NaN
3,7,Étienne,Jauvin,Level 2 Sales Representative,+33 1 68 94 52 20,JPN,DE,NaN
4,12,Elsbeth,Wiesinger,Level 2 Sales Representative,+(49) 40 663 1990,KOR,DE,NaN

## Data toevoegen

### Rijen

Gebruik de originele databasetabel *sales_staff*.<br>
Voeg een extra rij toe met eigen invulling. Zorg ervoor dat de index netjes doorloopt.<br>
Hulpvraag: welke waarde geef je nu aan axis?

In [117]:
newRow = {
    "SALES_STAFF_CODE": 10,
    "FIRST_NAME": "Alex",
    "LAST_NAME": "Chang",
    "POSITION_EN": "CEO",
    "WORK_PHONE": "+31 657885572",
    "EXTENSION": "BOSS",
    "FAX": 1234,
    "EMAIL": "THEBOSS@CEO.COM",
    "DATE_HIRED": "01-01-2001",
    "SALES_BRANCH_CODE": "REKT",
    "MANAGER_CODE": 19
}

selectSalesStaff = "SELECT * FROM sales_staff"
response = con.cursor().execute(selectSalesStaff).fetchall()

salesStaffDf2 = pd.DataFrame(response)

newSalesStaff = salesStaffDf2._append(newRow, ignore_index=True)

print(newSalesStaff)

         0          1          2                             3  \
0      4.0      Denis       Pagé                Branch Manager
1      5.0  Élizabeth     Michel  Level 3 Sales Representative
2      6.0      Émile   Clermont  Level 1 Sales Representative
3      7.0    Étienne     Jauvin  Level 2 Sales Representative
4     12.0    Elsbeth  Wiesinger  Level 2 Sales Representative
..     ...        ...        ...                           ...
98   121.0   François    De Crée  Level 1 Sales Representative
99   122.0     Yvette    Lattrez  Level 3 Sales Representative
100  123.0      Willi  Seefelder  Level 2 Sales Representative
101  124.0     Sabine     Grüner  Level 3 Sales Representative
102    NaN        NaN        NaN                           NaN

                     4       5                  6                       7  \
0    +33 1 68 94 52 20   325.0  +33 1 68 94 56 60       DPage@grtd123.com
1    +33 1 68 94 52 20   336.0  +33 1 68 94 56 60     EMichel@grtd123.com
2    +33 1 68 94 52 20   378.0  +33 1 68 94 56 60   EClermont@grtd123.com
3    +33 1 68 94 52 20   398.0  +33 1 68 94 56 60     EJauvin@grtd123.com
4    +(49) 40 663 1990  1818.0  +(49) 40 663 4571  EWiesinger@grtd123.com
..                 ...     ...                ...                     ...
98     +32 16 20.73.21  1642.0    +32 16 20.73.32     FDecree@grtd123.com
99     +32 16 20.73.21  1633.0    +32 16 20.73.32    YLattrez@grtd123.com
100  +(43) 13 79 56 32   325.0  +(43) 13 79 56 33  WSeefelder@grtd123.com
101  +(43) 13 79 56 32   348.0  +(43) 13 79 56 33     SGruner@grtd123.com
102                NaN     NaN                NaN                     NaN

              8     9  ...  FIRST_NAME LAST_NAME POSITION_EN     WORK_PHONE  \
0    1996-11-03   6.0  ...         NaN       NaN         NaN            NaN
1    1995-06-08   6.0  ...         NaN       NaN         NaN            NaN
2    1998-04-07   6.0  ...         NaN       NaN         NaN            NaN
3    1997-08-16   6.0  ...         NaN       NaN         NaN            NaN
4    1997-02-27  13.0  ...         NaN       NaN         NaN            NaN
..          ...   ...  ...         ...       ...         ...            ...
98   1999-12-01  38.0  ...         NaN       NaN         NaN            NaN
99   1999-12-09  38.0  ...         NaN       NaN         NaN            NaN
100  1998-10-28  39.0  ...         NaN       NaN         NaN            NaN
101  1998-02-18  39.0  ...         NaN       NaN         NaN            NaN
102         NaN   NaN  ...        Alex     Chang         CEO  +31 657885572

    EXTENSION     FAX            EMAIL  DATE_HIRED SALES_BRANCH_CODE  \
0         NaN     NaN              NaN         NaN               NaN
1         NaN     NaN              NaN         NaN               NaN
2         NaN     NaN              NaN         NaN               NaN
3         NaN     NaN              NaN         NaN               NaN
4         NaN     NaN              NaN         NaN               NaN
..        ...     ...              ...         ...               ...
98        NaN     NaN              NaN         NaN               NaN
99        NaN     NaN              NaN         NaN               NaN
100       NaN     NaN              NaN         NaN               NaN
101       NaN     NaN              NaN         NaN               NaN
102      BOSS  1234.0  THEBOSS@CEO.COM  01-01-2001              REKT

    MANAGER_CODE
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
98           NaN
99           NaN
100          NaN
101          NaN
102         19.0

[103 rows x 21 columns]

### Kolommen

Voeg een kolom *FULL_NAME* toe die de waarden van *FIRST_NAME* en *LAST_NAME* achter elkaar zet, gescheiden door een spatie.

In [123]:

firstnameColumn = test.loc[:,1]
lastnameColumn = test.loc[:,2]


# test.insert(5,"FULLNAME", firstnameColumn + " " + lastnameColumn)

print(test)

            0          1              2                             3  \
0           4      Denis           Pagé                Branch Manager
1           5  Élizabeth         Michel  Level 3 Sales Representative
2           6      Émile       Clermont  Level 1 Sales Representative
3           7    Étienne         Jauvin  Level 2 Sales Representative
4          12    Elsbeth      Wiesinger  Level 2 Sales Representative
..        ...        ...            ...                           ...
98        121   François        De Crée  Level 1 Sales Representative
99        122     Yvette        Lattrez  Level 3 Sales Representative
100       123      Willi      Seefelder  Level 2 Sales Representative
101       124     Sabine         Grüner  Level 3 Sales Representative
102  testcode  testphone  testextension                       testfax

                     4                 FULLNAME THIRD_LANGUAGE  \
0    +33 1 68 94 52 20               Denis Pagé             NL
1    +33 1 68 94 52 20         Élizabeth Michel             NL
2    +33 1 68 94 52 20           Émile Clermont            JPN
3    +33 1 68 94 52 20           Étienne Jauvin            JPN
4    +(49) 40 663 1990        Elsbeth Wiesinger            KOR
..                 ...                      ...            ...
98     +32 16 20.73.21         François De Crée            NaN
99     +32 16 20.73.21           Yvette Lattrez            NaN
100  +(43) 13 79 56 32          Willi Seefelder            NaN
101  +(43) 13 79 56 32            Sabine Grüner            NaN
102           testmail  testphone testextension            NaN

    SECOND_LANGUAGE FIRST_LANGUAGE
0                FR             EN
1                FR            NaN
2                FR            NaN
3                DE            NaN
4                DE            NaN
..              ...            ...
98              NaN            NaN
99              NaN            NaN
100             NaN            NaN
101             NaN            NaN
102             NaN            NaN

[103 rows x 9 columns]

## Data wijzigen

### Datatypen

Door het attribuut .dtypes van een DataFrame op te vragen krijg je een serie die per kolom het datatype weergeeft. Doe dit bij de originele databasetabel *sales_staff*

In [126]:
df = pd.DataFrame(test)

df.dtypes

0                  object
1                  object
2                  object
3                  object
4                  object
FULLNAME           object
THIRD_LANGUAGE     object
SECOND_LANGUAGE    object
FIRST_LANGUAGE     object
dtype: object

Hier valt op dat elke kolom het datatype 'object' heeft: Python leest dus alles als string. Wiskundige operaties zijn hierdoor niet mogelijk.<br>
We kunnen proberen om kolommen met getallen, bijvoorbeeld de 'extension', te converteren naar een int. Zie onderstaande code.

In [3]:
sales_staff['EXTENSION'] = sales_staff['EXTENSION'].astype(int)
sales_staff.dtypes

NameError: name 'sales_staff' is not defined

Dit lukt echter niet, omdat er in de kolom 'EXTENSION' lege waarden zitten die niet geconverteerd kunnen worden naar een int.<br>
Wél kan je deze naar een float converteren, zie onderstaande code:

In [ ]:
sales_staff['EXTENSION'] = sales_staff['EXTENSION'].astype(float)
sales_staff.dtypes

Als we in de rij van 'EXTENSION' kijken zien we dat de conversie van het datatype nu is gelukt.<br>
Dit is <b>randvoorwaardelijk</b> voor het uitvoeren van wiskundige operaties.<br>

### Rijen

Zorg er nu voor dat bij alle extensions 1 wordt opgeteld.

In [ ]:
newSalesStaff['EXTENSION'] = newSalesStaff['EXTENSION'].astype(float) + 1

Elke 'Branch Manager' wordt nu 'General Manager'. Schrijf code zodat deze wijziging doorgevoerd wordt in het DataFrame.

In [129]:

    
newSalesStaff['POSITION_EN'] = newSalesStaff['POSITION_EN'].replace('Branch Manager', "General Manager")


print(newSalesStaff)

         0          1          2                             3  \
0      4.0      Denis       Pagé                Branch Manager
1      5.0  Élizabeth     Michel  Level 3 Sales Representative
2      6.0      Émile   Clermont  Level 1 Sales Representative
3      7.0    Étienne     Jauvin  Level 2 Sales Representative
4     12.0    Elsbeth  Wiesinger  Level 2 Sales Representative
..     ...        ...        ...                           ...
98   121.0   François    De Crée  Level 1 Sales Representative
99   122.0     Yvette    Lattrez  Level 3 Sales Representative
100  123.0      Willi  Seefelder  Level 2 Sales Representative
101  124.0     Sabine     Grüner  Level 3 Sales Representative
102    NaN        NaN        NaN                           NaN

                     4       5                  6                       7  \
0    +33 1 68 94 52 20   325.0  +33 1 68 94 56 60       DPage@grtd123.com
1    +33 1 68 94 52 20   336.0  +33 1 68 94 56 60     EMichel@grtd123.com
2    +33 1 68 94 52 20   378.0  +33 1 68 94 56 60   EClermont@grtd123.com
3    +33 1 68 94 52 20   398.0  +33 1 68 94 56 60     EJauvin@grtd123.com
4    +(49) 40 663 1990  1818.0  +(49) 40 663 4571  EWiesinger@grtd123.com
..                 ...     ...                ...                     ...
98     +32 16 20.73.21  1642.0    +32 16 20.73.32     FDecree@grtd123.com
99     +32 16 20.73.21  1633.0    +32 16 20.73.32    YLattrez@grtd123.com
100  +(43) 13 79 56 32   325.0  +(43) 13 79 56 33  WSeefelder@grtd123.com
101  +(43) 13 79 56 32   348.0  +(43) 13 79 56 33     SGruner@grtd123.com
102                NaN     NaN                NaN                     NaN

              8     9  ...  FIRST_NAME LAST_NAME POSITION_EN     WORK_PHONE  \
0    1996-11-03   6.0  ...         NaN       NaN         NaN            NaN
1    1995-06-08   6.0  ...         NaN       NaN         NaN            NaN
2    1998-04-07   6.0  ...         NaN       NaN         NaN            NaN
3    1997-08-16   6.0  ...         NaN       NaN         NaN            NaN
4    1997-02-27  13.0  ...         NaN       NaN         NaN            NaN
..          ...   ...  ...         ...       ...         ...            ...
98   1999-12-01  38.0  ...         NaN       NaN         NaN            NaN
99   1999-12-09  38.0  ...         NaN       NaN         NaN            NaN
100  1998-10-28  39.0  ...         NaN       NaN         NaN            NaN
101  1998-02-18  39.0  ...         NaN       NaN         NaN            NaN
102         NaN   NaN  ...        Alex     Chang         CEO  +31 657885572

    EXTENSION     FAX            EMAIL  DATE_HIRED SALES_BRANCH_CODE  \
0         NaN     NaN              NaN         NaN               NaN
1         NaN     NaN              NaN         NaN               NaN
2         NaN     NaN              NaN         NaN               NaN
3         NaN     NaN              NaN         NaN               NaN
4         NaN     NaN              NaN         NaN               NaN
..        ...     ...              ...         ...               ...
98        NaN     NaN              NaN         NaN               NaN
99        NaN     NaN              NaN         NaN               NaN
100       NaN     NaN              NaN         NaN               NaN
101       NaN     NaN              NaN         NaN               NaN
102      BOSS  1234.0  THEBOSS@CEO.COM  01-01-2001              REKT

    MANAGER_CODE
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
98           NaN
99           NaN
100          NaN
101          NaN
102         19.0

[103 rows x 21 columns]

### Kolommen

Verander de kolomnaam 'POSITION_EN' naar 'POSITION'.

In [132]:


df.rename(columns={3: "POSITION"}, inplace=True )

df.head(5)

,0,1,2,POSITION,4,FULLNAME,THIRD_LANGUAGE,SECOND_LANGUAGE,FIRST_LANGUAGE
0,4,Denis,Pagé,Branch Manager,+33 1 68 94 52 20,Denis Pagé,NL,FR,EN
1,5,Élizabeth,Michel,Level 3 Sales Representative,+33 1 68 94 52 20,Élizabeth Michel,NL,FR,NaN
2,6,Émile,Clermont,Level 1 Sales Representative,+33 1 68 94 52 20,Émile Clermont,JPN,FR,NaN
3,7,Étienne,Jauvin,Level 2 Sales Representative,+33 1 68 94 52 20,Étienne Jauvin,JPN,DE,NaN
4,12,Elsbeth,Wiesinger,Level 2 Sales Representative,+(49) 40 663 1990,Elsbeth Wiesinger,KOR,DE,NaN

## Data verwijderen

### Rijen

De medewerkers op indexen 99, 100 en 101 hebben helaas ontslag genomen.<br>
Verwijder de bijbehorende rijen uit het DataFrame. Gebruik slechts één keer de .drop()-methode.

In [135]:
df.drop([99,100,101] ,inplace=True )

print(df)

            0          1              2                      POSITION  \
0           4      Denis           Pagé                Branch Manager
1           5  Élizabeth         Michel  Level 3 Sales Representative
2           6      Émile       Clermont  Level 1 Sales Representative
3           7    Étienne         Jauvin  Level 2 Sales Representative
4          12    Elsbeth      Wiesinger  Level 2 Sales Representative
..        ...        ...            ...                           ...
95        118     Gianni      Vertemati  Level 1 Sales Representative
96        119      Gracy        Gellens                Branch Manager
97        120      Giele       Laermans  Level 1 Sales Representative
98        121   François        De Crée  Level 1 Sales Representative
102  testcode  testphone  testextension                       testfax

                     4                 FULLNAME THIRD_LANGUAGE  \
0    +33 1 68 94 52 20               Denis Pagé             NL
1    +33 1 68 94 52 20         Élizabeth Michel             NL
2    +33 1 68 94 52 20           Émile Clermont            JPN
3    +33 1 68 94 52 20           Étienne Jauvin            JPN
4    +(49) 40 663 1990        Elsbeth Wiesinger            KOR
..                 ...                      ...            ...
95   +(41) 17 12 13 14         Gianni Vertemati            NaN
96     +32 16 20.73.21            Gracy Gellens            NaN
97     +32 16 20.73.21           Giele Laermans            NaN
98     +32 16 20.73.21         François De Crée            NaN
102           testmail  testphone testextension            NaN

    SECOND_LANGUAGE FIRST_LANGUAGE
0                FR             EN
1                FR            NaN
2                FR            NaN
3                DE            NaN
4                DE            NaN
..              ...            ...
95              NaN            NaN
96              NaN            NaN
97              NaN            NaN
98              NaN            NaN
102             NaN            NaN

[100 rows x 9 columns]

### Kolommen

Faxen zijn inmiddels ouderwets: niemand gebruikt zijn/haar faxnummer nog.<br>
Verwijder de bijbehorende kolom uit het DataFrame.

In [148]:


df.drop(columns= [4], inplace=True, axis = 1)

print(df)

            0          1              2                      POSITION  \
0           4      Denis           Pagé                Branch Manager
1           5  Élizabeth         Michel  Level 3 Sales Representative
2           6      Émile       Clermont  Level 1 Sales Representative
3           7    Étienne         Jauvin  Level 2 Sales Representative
4          12    Elsbeth      Wiesinger  Level 2 Sales Representative
..        ...        ...            ...                           ...
95        118     Gianni      Vertemati  Level 1 Sales Representative
96        119      Gracy        Gellens                Branch Manager
97        120      Giele       Laermans  Level 1 Sales Representative
98        121   François        De Crée  Level 1 Sales Representative
102  testcode  testphone  testextension                       testfax

                    FULLNAME THIRD_LANGUAGE SECOND_LANGUAGE FIRST_LANGUAGE
0                 Denis Pagé             NL              FR             EN
1           Élizabeth Michel             NL              FR            NaN
2             Émile Clermont            JPN              FR            NaN
3             Étienne Jauvin            JPN              DE            NaN
4          Elsbeth Wiesinger            KOR              DE            NaN
..                       ...            ...             ...            ...
95          Gianni Vertemati            NaN             NaN            NaN
96             Gracy Gellens            NaN             NaN            NaN
97            Giele Laermans            NaN             NaN            NaN
98          François De Crée            NaN             NaN            NaN
102  testphone testextension            NaN             NaN            NaN

[100 rows x 8 columns]